OldTests/Linux-Quemu/benchmark_raw_20260415_000923/raw_logs/fio_rand_4k_raw.txt
rand_4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.39
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

rand_4k: (groupid=0, jobs=1): err= 0: pid=242884: Wed Apr 15 00:21:54 2026
  read: IOPS=3354, BW=13.1MiB/s (13.7MB/s)(786MiB/60001msec)
    clat (usec): min=65, max=42095, avg=218.39, stdev=226.72
     lat (usec): min=65, max=42095, avg=218.49, stdev=226.75
    clat percentiles (usec):
     |  1.00th=[  108],  5.00th=[  118], 10.00th=[  125], 20.00th=[  141],
     | 30.00th=[  182], 40.00th=[  186], 50.00th=[  192], 60.00th=[  198],
     | 70.00th=[  202], 80.00th=[  210], 90.00th=[  237], 95.00th=[  375],
     | 99.00th=[ 1500], 99.50th=[ 1844], 99.90th=[ 2278], 99.95th=[ 2311],
     | 99.99th=[ 3556]
   bw (  KiB/s): min= 3536, max=15776, per=100.00%, avg=13443.09, stdev=2455.75, samples=119
   iops        : min=  884, max= 3944, avg=3360.77, stdev=613.94, samples=119
  write: IOPS=3352, BW=13.1MiB/s (13.7MB/s)(786MiB/60001msec); 0 zone resets
    clat (usec): min=50, max=34487, avg=77.20, stdev=98.53
     lat (usec): min=50, max=34487, avg=77.35, stdev=98.62
    clat percentiles (usec):
     |  1.00th=[   53],  5.00th=[   56], 10.00th=[   56], 20.00th=[   58],
     | 30.00th=[   60], 40.00th=[   62], 50.00th=[   65], 60.00th=[   68],
     | 70.00th=[   70], 80.00th=[   74], 90.00th=[   91], 95.00th=[  115],
     | 99.00th=[  457], 99.50th=[  498], 99.90th=[  586], 99.95th=[  611],
     | 99.99th=[  652]
   bw (  KiB/s): min= 3624, max=16456, per=100.00%, avg=13433.95, stdev=2494.92, samples=119
   iops        : min=  906, max= 4114, avg=3358.49, stdev=623.73, samples=119
  lat (usec)   : 100=46.09%, 250=48.91%, 500=2.81%, 750=1.30%, 1000=0.21%
  lat (msec)   : 2=0.48%, 4=0.18%, 10=0.01%, 50=0.01%
  cpu          : usr=2.62%, sys=9.38%, ctx=402445, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=201293,201144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=13.1MiB/s (13.7MB/s), 13.1MiB/s-13.1MiB/s (13.7MB/s-13.7MB/s), io=786MiB (824MB), run=60001-60001msec
  WRITE: bw=13.1MiB/s (13.7MB/s), 13.1MiB/s-13.1MiB/s (13.7MB/s-13.7MB/s), io=786MiB (824MB), run=60001-60001msec

Disk stats (read/write):
  vda: ios=200977/200875, sectors=1607816/1607160, merge=0/20, ticks=42140/13821, in_queue=55965, util=92.71%